app/views/questions/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---

    <% user_first_name = User.find(@question.user_id).first_name%>