app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "No its not"], ["question_id", 33], ["created_at", "2017-10-25 00:51:04.549086"], ["updated_at", "2017-10-25 00:51:04.549086"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2017-10-25 01:00:09.194285"], ["id", 4]]
---
    def create
        @comment = @question.comments.create(comment_params)

        if @comment.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 36]]
---
        def find_question
            @question = Question.find(params[:question_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."question_id" = ? AND "comments"."id" = ? LIMIT 1  [["question_id", 36], ["id", 9]]
---
        def find_comment
            @comment = @question.comments.find(params[:id])