app/controllers/questions_controller.rb

    def index
        @questions = Question.all.order("created_at DESC")
---
SELECT "questions".* FROM "questions"  ORDER BY created_at DESC

    def create
        @question = current_user.questions.build(question_params)
        if @question.save
---
INSERT INTO "questions" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "USER ID!!!!"], ["user_id", 1], ["created_at", "2017-10-25 00:06:53.162447"], ["updated_at", "2017-10-25 00:06:53.162447"]]

    def update
        if @question.update(question_params)
---
UPDATE "questions" SET "title" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["title", "sadasdas"], ["updated_at", "2017-10-24 12:14:06.046762"], ["id", 14]]

        def find_question
            @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 14]]